Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-getResultsURL.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "REGION"                     = "ap-southeast-3"
              - "RESULT_DURATION"            = "86400"
              - "RESULT_SUFFIX"              = "_results.tsv"
              - "SVEP_RESULTS"               = "gaspi-dataportal-20250120051259130100000001"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-initQuery.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-initQuery"
        name             = "svep-backend-initQuery"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatStarter",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginClinvar.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginClinvar/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/05b68c8095a6eb71e66cdcee29b9e167ca52ccb0851d794c2983e969cd59a580.zip' 'python3.12' '/root/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/143/default/svep/lambda/pluginClinvar'"
          + "filename_new"   = "builds/05b68c8095a6eb71e66cdcee29b9e167ca52ccb0851d794c2983e969cd59a580.zip"
          + "filename_old"   = "builds/05b68c8095a6eb71e66cdcee29b9e167ca52ccb0851d794c2983e969cd59a580.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginClinvar"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-pluginClinvar.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-pluginClinvar"
        name             = "svep-backend-pluginClinvar"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomad",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1984819716" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/5fb71f9077fe07f105495536854bb0dc09c1bb71065bf741aef25f592d14c623.zip" -> "builds/05b68c8095a6eb71e66cdcee29b9e167ca52ccb0851d794c2983e969cd59a580.zip"
        }
    }

  # module.svep.module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:9f579649e7d47b2ddea4f348eff0f467490a3bd2a4bd523045b2a472ea3c42a7" -> (known after apply)
      ~ last_modified                  = "2025-04-10T07:14:33.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "svep-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-pluginGnomad.aws_iam_policy.additional[0] will be destroyed
  # (because aws_iam_policy.additional is not in configuration)
  - resource "aws_iam_policy" "additional" {
      - arn              = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad" -> null
      - name             = "svep-backend-pluginGnomad" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomadExecutor",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomad",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATBRPQCZXE4TCHJFE7" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginGnomad.aws_iam_policy.logs[0] will be destroyed
  # (because aws_iam_policy.logs is not in configuration)
  - resource "aws_iam_policy" "logs" {
      - arn              = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad-logs" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad-logs" -> null
      - name             = "svep-backend-pluginGnomad-logs" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-pluginGnomad:*:*",
                          - "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-pluginGnomad:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATBRPQCZXGLIUH2D4Y" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginGnomad.aws_iam_policy_attachment.additional[0] will be destroyed
  # (because aws_iam_policy_attachment.additional is not in configuration)
  - resource "aws_iam_policy_attachment" "additional" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomad" -> null
      - name       = "svep-backend-pluginGnomad" -> null
      - policy_arn = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad" -> null
      - roles      = [
          - "svep-backend-pluginGnomad",
        ] -> null
      - users      = [] -> null
    }

  # module.svep.module.lambda-pluginGnomad.aws_iam_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_policy_attachment.logs is not in configuration)
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomad-logs" -> null
      - name       = "svep-backend-pluginGnomad-logs" -> null
      - policy_arn = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad-logs" -> null
      - roles      = [
          - "svep-backend-pluginGnomad",
        ] -> null
      - users      = [] -> null
    }

  # module.svep.module.lambda-pluginGnomad.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::209479276142:role/svep-backend-pluginGnomad" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-03-20T04:14:48Z" -> null
      - force_detach_policies = false -> null
      - id                    = "svep-backend-pluginGnomad" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad",
          - "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomad-logs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "svep-backend-pluginGnomad" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all              = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - unique_id             = "AROATBRPQCZXNO2B3WXTH" -> null
        # (3 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be destroyed
  # (because aws_lambda_function.lambda is not in configuration)
  - resource "aws_lambda_function" "lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomad" -> null
      - code_sha256                    = "IMa1tCRYNd6+Z8cEzp8gtN7E5HSa0kWUBO19vU1UQXI=" -> null
      - description                    = "Add Gnomad annotations to sVEP result rows." -> null
      - filename                       = ".terraform/modules/svep.lambda-pluginGnomad/builds/3a5ade739af103920e7115389d5e1a7e78c77a7e1926874bca79cb70cf1a5b6c.zip" -> null
      - function_name                  = "svep-backend-pluginGnomad" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "svep-backend-pluginGnomad" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomad/invocations" -> null
      - last_modified                  = "2025-04-14T03:38:15.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_binaries_layer:19",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> null
      - memory_size                    = 2048 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomad:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomad:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::209479276142:role/svep-backend-pluginGnomad" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 45760841 -> null
      - tags                           = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all                       = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - timeout                        = 300 -> null
      - version                        = "$LATEST" -> null
        # (5 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA"        = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "GNOMAD_PUBLIC_CHR1"                   = "https://gnomad-public-us-east-1.s3.amazonaws.com/release/4.1/vcf/genomes/gnomad.genomes.v4.1.sites.chr1.vcf.bgz"
              - "PLUGIN_GNOMAD_EXECUTOR_SNS_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomadExecutor"
              - "PLUGIN_GNOMAD_SNS_TOPIC_ARN"          = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomad"
              - "SEND_JOB_EMAIL_ARN"                   = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                         = "svep-backend-regions-20250103055725292400000005"
              - "SVEP_TEMP"                            = "svep-backend-temp-20250103055724965800000004"
              - "USER_POOL_ID"                         = "ap-southeast-3_TPJOWHZvH"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/svep-backend-pluginGnomad" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.svep.module.lambda-pluginGnomad.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "268119445" -> null
      - triggers = {
          - "filename" = "builds/3a5ade739af103920e7115389d5e1a7e78c77a7e1926874bca79cb70cf1a5b6c.zip"
        } -> null
    }

  # module.svep.module.lambda-pluginGnomadExecutor.aws_iam_policy.additional[0] will be destroyed
  # (because aws_iam_policy.additional is not in configuration)
  - resource "aws_iam_policy" "additional" {
      - arn              = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor" -> null
      - name             = "svep-backend-pluginGnomadExecutor" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomadExecutor",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomad",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATBRPQCZXMH4233KMH" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginGnomadExecutor.aws_iam_policy.logs[0] will be destroyed
  # (because aws_iam_policy.logs is not in configuration)
  - resource "aws_iam_policy" "logs" {
      - arn              = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor-logs" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor-logs" -> null
      - name             = "svep-backend-pluginGnomadExecutor-logs" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-pluginGnomadExecutor:*:*",
                          - "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-pluginGnomadExecutor:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATBRPQCZXALFRMHAH6" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginGnomadExecutor.aws_iam_policy_attachment.additional[0] will be destroyed
  # (because aws_iam_policy_attachment.additional is not in configuration)
  - resource "aws_iam_policy_attachment" "additional" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomadExecutor" -> null
      - name       = "svep-backend-pluginGnomadExecutor" -> null
      - policy_arn = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor" -> null
      - roles      = [
          - "svep-backend-pluginGnomadExecutor",
        ] -> null
      - users      = [] -> null
    }

  # module.svep.module.lambda-pluginGnomadExecutor.aws_iam_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_policy_attachment.logs is not in configuration)
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginGnomadExecutor-logs" -> null
      - name       = "svep-backend-pluginGnomadExecutor-logs" -> null
      - policy_arn = "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor-logs" -> null
      - roles      = [
          - "svep-backend-pluginGnomadExecutor",
        ] -> null
      - users      = [] -> null
    }

  # module.svep.module.lambda-pluginGnomadExecutor.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::209479276142:role/svep-backend-pluginGnomadExecutor" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-04-09T11:16:00Z" -> null
      - force_detach_policies = false -> null
      - id                    = "svep-backend-pluginGnomadExecutor" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor",
          - "arn:aws:iam::209479276142:policy/svep-backend-pluginGnomadExecutor-logs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "svep-backend-pluginGnomadExecutor" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all              = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - unique_id             = "AROATBRPQCZXHSDMULGLV" -> null
        # (3 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginGnomadExecutor.aws_lambda_function.lambda[0] will be destroyed
  # (because aws_lambda_function.lambda is not in configuration)
  - resource "aws_lambda_function" "lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomadExecutor" -> null
      - code_sha256                    = "8MRlLVKBfPR8EQ3QE1OowAuAeWVJvTrUc0Psm4GCPgQ=" -> null
      - description                    = "Add pluginGnomadExecutor annotations to sVEP result rows." -> null
      - filename                       = ".terraform/modules/svep.lambda-pluginGnomadExecutor/builds/310d432e16bbeee4aec468b361fb1f7005629e997cece1cda03ce64f95c93f85.zip" -> null
      - function_name                  = "svep-backend-pluginGnomadExecutor" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "svep-backend-pluginGnomadExecutor" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomadExecutor/invocations" -> null
      - last_modified                  = "2025-04-10T07:14:25.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_binaries_layer:19",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> null
      - memory_size                    = 2048 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomadExecutor:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginGnomadExecutor:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::209479276142:role/svep-backend-pluginGnomadExecutor" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 1796 -> null
      - tags                           = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all                       = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - timeout                        = 300 -> null
      - version                        = "$LATEST" -> null
        # (5 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA"        = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "GNOMAD_PUBLIC_CHR1"                   = "https://gnomad-public-us-east-1.s3.amazonaws.com/release/4.1/vcf/genomes/gnomad.genomes.v4.1.sites.chr1.vcf.bgz"
              - "PLUGIN_GNOMAD_EXECUTOR_SNS_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomadExecutor"
              - "PLUGIN_GNOMAD_SNS_TOPIC_ARN"          = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginGnomad"
              - "SEND_JOB_EMAIL_ARN"                   = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                         = "svep-backend-regions-20250103055725292400000005"
              - "SVEP_TEMP"                            = "svep-backend-temp-20250103055724965800000004"
              - "USER_POOL_ID"                         = "ap-southeast-3_TPJOWHZvH"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/svep-backend-pluginGnomadExecutor" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.svep.module.lambda-pluginGnomadExecutor.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "1551135028" -> null
      - triggers = {
          - "filename" = "builds/310d432e16bbeee4aec468b361fb1f7005629e997cece1cda03ce64f95c93f85.zip"
        } -> null
    }

  # module.svep.module.lambda-pluginUpdownstream.aws_iam_policy.additional[0] will be destroyed
  # (because aws_iam_policy.additional is not in configuration)
  - resource "aws_iam_policy" "additional" {
      - arn              = "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream" -> null
      - name             = "svep-backend-pluginUpdownstream" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-regions-20250103055725292400000005/*"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250103055724963600000003"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATBRPQCZXFAG5NQCYZ" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginUpdownstream.aws_iam_policy.logs[0] will be destroyed
  # (because aws_iam_policy.logs is not in configuration)
  - resource "aws_iam_policy" "logs" {
      - arn              = "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream-logs" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream-logs" -> null
      - name             = "svep-backend-pluginUpdownstream-logs" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-pluginUpdownstream:*:*",
                          - "arn:aws:logs:*:209479276142:log-group:/aws/lambda/svep-backend-pluginUpdownstream:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATBRPQCZXPFO7XWEJ7" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginUpdownstream.aws_iam_policy_attachment.additional[0] will be destroyed
  # (because aws_iam_policy_attachment.additional is not in configuration)
  - resource "aws_iam_policy_attachment" "additional" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginUpdownstream" -> null
      - name       = "svep-backend-pluginUpdownstream" -> null
      - policy_arn = "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream" -> null
      - roles      = [
          - "svep-backend-pluginUpdownstream",
        ] -> null
      - users      = [] -> null
    }

  # module.svep.module.lambda-pluginUpdownstream.aws_iam_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_policy_attachment.logs is not in configuration)
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "svep-backend-pluginUpdownstream-logs" -> null
      - name       = "svep-backend-pluginUpdownstream-logs" -> null
      - policy_arn = "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream-logs" -> null
      - roles      = [
          - "svep-backend-pluginUpdownstream",
        ] -> null
      - users      = [] -> null
    }

  # module.svep.module.lambda-pluginUpdownstream.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::209479276142:role/svep-backend-pluginUpdownstream" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-01-14T06:08:58Z" -> null
      - force_detach_policies = false -> null
      - id                    = "svep-backend-pluginUpdownstream" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream",
          - "arn:aws:iam::209479276142:policy/svep-backend-pluginUpdownstream-logs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "svep-backend-pluginUpdownstream" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all              = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - unique_id             = "AROATBRPQCZXMZK3DC3M5" -> null
        # (3 unchanged attributes hidden)
    }

  # module.svep.module.lambda-pluginUpdownstream.aws_lambda_function.lambda[0] will be destroyed
  # (because aws_lambda_function.lambda is not in configuration)
  - resource "aws_lambda_function" "lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginUpdownstream" -> null
      - code_sha256                    = "FlpLIl1IA0yu3803K7SrJmUr4zJm/GT2LnFjl3XbgVs=" -> null
      - description                    = "Write upstream and downstream gene variant to temp bucket." -> null
      - filename                       = ".terraform/modules/svep.lambda-pluginUpdownstream/builds/c805f91623433c5b0de89a75a3b9370380e1e8fa9bb2eeb3e2404f17c95f9dbd.zip" -> null
      - function_name                  = "svep-backend-pluginUpdownstream" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "svep-backend-pluginUpdownstream" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginUpdownstream/invocations" -> null
      - last_modified                  = "2025-04-10T07:14:52.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_binaries_layer:19",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> null
      - memory_size                    = 2048 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginUpdownstream:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-pluginUpdownstream:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::209479276142:role/svep-backend-pluginUpdownstream" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 1804 -> null
      - tags                           = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all                       = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - timeout                        = 24 -> null
      - version                        = "$LATEST" -> null
        # (5 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "HTS_S3_HOST"                   = "s3.ap-southeast-3.amazonaws.com"
              - "REFERENCE_GENOME"              = "transcripts_Homo_sapiens.GRCh38.gtf.bgz"
              - "REFERENCE_LOCATION"            = "svep-backend-references-20250103055724963600000003"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_REGIONS"                  = "svep-backend-regions-20250103055725292400000005"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250103055724965800000004"
              - "USER_POOL_ID"                  = "ap-southeast-3_TPJOWHZvH"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/svep-backend-pluginUpdownstream" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.svep.module.lambda-pluginUpdownstream.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "1404047390" -> null
      - triggers = {
          - "filename" = "builds/c805f91623433c5b0de89a75a3b9370380e1e8fa9bb2eeb3e2404f17c95f9dbd.zip"
        } -> null
    }

  # module.svep.module.lambda-queryGTF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryGTF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/2eb699586930476b2c431443e1559f1cea16d6603790cc18429ddc63186e3781.zip' 'python3.12' '/root/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/143/default/svep/lambda/queryGTF'"
          + "filename_new"   = "builds/2eb699586930476b2c431443e1559f1cea16d6603790cc18429ddc63186e3781.zip"
          + "filename_old"   = "builds/2eb699586930476b2c431443e1559f1cea16d6603790cc18429ddc63186e3781.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryGTF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryGTF.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-queryGTF"
        name             = "svep-backend-queryGTF"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryGTF",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginUpdownstream",
                            "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-pluginConsequence",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                    # (5 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-queryGTF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "335464235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/4a99ab0f94178cda21dc82b7137a2cd1e44f130c41120a1bc7b110c39e0089c9.zip" -> "builds/2eb699586930476b2c431443e1559f1cea16d6603790cc18429ddc63186e3781.zip"
        }
    }

  # module.svep.module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/f10cc4a0d0fc4a1977a69029d5a1c2b27b472b2425849d95bd046e0e7e78a527.zip' 'python3.12' '/root/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/143/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/f10cc4a0d0fc4a1977a69029d5a1c2b27b472b2425849d95bd046e0e7e78a527.zip"
          + "filename_old"   = "builds/f10cc4a0d0fc4a1977a69029d5a1c2b27b472b2425849d95bd046e0e7e78a527.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryVCF.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-queryVCF"
        name             = "svep-backend-queryVCF"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryVCFsubmit",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryVCF",
                          - "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryGTF",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250120051259130100000001"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_TPJOWHZvH"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-queryVCF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1976201078" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/eb1b655e912b7819100093116a51b6d29bf9c6bf6a84c84314ef284c6327509d.zip" -> "builds/f10cc4a0d0fc4a1977a69029d5a1c2b27b472b2425849d95bd046e0e7e78a527.zip"
        }
    }

  # module.svep.module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0c3a0e9c1723e6c9b190bb6da7f5f9c2e485ce37d24789faaf01dd3f0deb23c4.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0c3a0e9c1723e6c9b190bb6da7f5f9c2e485ce37d24789faaf01dd3f0deb23c4.plan.json"
      + id                   = (known after apply)
    }

  # module.svep.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "628181936" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/70393e89c5cd0eed9ca81d1f49ea302941bb8d7702b13e9c7cb60925dedb127e.zip" -> "builds/0c3a0e9c1723e6c9b190bb6da7f5f9c2e485ce37d24789faaf01dd3f0deb23c4.zip"
          ~ "timestamp" = "1742780899118110000" -> "1744630980477385000"
        }
    }

  # module.svep.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40" -> (known after apply)
      ~ code_sha256                 = "z/3fSg+dbO+t6u3TxvXTEpJT8+5afWIG4JGEsoCRKxc=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-04-10T04:57:34.312+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:40" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/ce9861cfb66fe4c28f95fd44f7d541a0652586e20530428d1facad24fcec8f50.zip" -> "builds/3efb5c7a6217347e79909c743769848c44b94e59a97595962b9fa446324fdd00.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 11002 -> (known after apply)
      ~ version                     = "40" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250103055724913100000001/builds/ce9861cfb66fe4c28f95fd44f7d541a0652586e20530428d1facad24fcec8f50.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "795bbd46434a5e6008dd645263da9b15" -> (known after apply)
      ~ id                            = "builds/ce9861cfb66fe4c28f95fd44f7d541a0652586e20530428d1facad24fcec8f50.zip" -> (known after apply)
      ~ key                           = "builds/ce9861cfb66fe4c28f95fd44f7d541a0652586e20530428d1facad24fcec8f50.zip" -> "builds/3efb5c7a6217347e79909c743769848c44b94e59a97595962b9fa446324fdd00.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/ce9861cfb66fe4c28f95fd44f7d541a0652586e20530428d1facad24fcec8f50.zip" -> "builds/3efb5c7a6217347e79909c743769848c44b94e59a97595962b9fa446324fdd00.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3efb5c7a6217347e79909c743769848c44b94e59a97595962b9fa446324fdd00.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3efb5c7a6217347e79909c743769848c44b94e59a97595962b9fa446324fdd00.plan.json"
      + id                   = (known after apply)
    }

  # module.svep.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2137756811" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ce9861cfb66fe4c28f95fd44f7d541a0652586e20530428d1facad24fcec8f50.zip" -> "builds/3efb5c7a6217347e79909c743769848c44b94e59a97595962b9fa446324fdd00.zip"
          ~ "timestamp" = "1744260802347611000" -> "1744630983292749000"
        }
    }

Plan: 75 to add, 51 to change, 91 to destroy.
╷
│ Error: Error in function call
│ 
│   on sbeacon/layers.tf line 15, in resource "aws_lambda_layer_version" "binaries_layer":
│   15:   source_code_hash = filebase64sha256("${data.archive_file.binaries_layer.output_path}")
│     ├────────────────
│     │ while calling filebase64sha256(path)
│     │ data.archive_file.binaries_layer.output_path is "sbeacon/binaries.zip"
│ 
│ Call to function "filebase64sha256" failed: open sbeacon/binaries.zip: no
│ such file or directory.
╵
╷
│ Error: Archive creation error
│ 
│   with module.svep.data.archive_file.binaries_layer,
│   on svep/layers.tf line 3, in data "archive_file" "binaries_layer":
│    3: data "archive_file" "binaries_layer" {
│ 
│ error creating archive: error archiving directory: could not archive
│ missing directory: svep/layers/binaries/
╵



```
</details>